КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ТрН_Титул6/КонтурЛогистика_ТрН_Титул6.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонтурЛогистика_ТрН_Титул6</name>
  <posting>Deny</posting>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументЭТРН</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>будет отображаться только в диадоке, не попадет в ЭтРН</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатПУДИнфГО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрПУДИнфГО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательПодписант</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрНастроекПодписания</name>
    <comment>Параметр используется для поиска подписанта по дополнительному параметру</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>НаимДокОснДовОргСост</name>
    <comment>Наименование документа-основания, по которому экономический субъект является составителем файла обмена первичного учетного документа о факте хозяйственной жизни (информации грузоотправителя)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокОснДовОргСост</name>
    <comment>Номер документа-основания, по которому экономический субъект является составителем файла обмена первичного учетного документа о факте хозяйственной жизни (информации грузоотправителя)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокОснДовОргСост</name>
    <comment>Дата документа-основания, по которому экономический субъект является составителем файла обмена первичного учетного документа о факте хозяйственной жизни (информации грузоотправителя)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопСведДокОснДовОргСост</name>
    <comment>Доп. сведения документа-основания, по которому экономический субъект является составителем файла обмена первичного учетного документа о факте хозяйственной жизни (информации грузоотправителя)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтороныСостДокОснДовОргСост</name>
    <comment>Стороны составители документа-основания, по которому экономический субъект является составителем файла обмена первичного учетного документа о факте хозяйственной жизни (информации грузоотправителя)</comment>
    <type>
      <types>EnumRef.КонтурЛогистика_СтороныСоставители</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопСостДокОснДовОргСост</name>
    <comment>Доп. составитель документа-основания, по которому экономический субъект является составителем файла обмена первичного учетного документа о факте хозяйственной жизни (информации грузоотправителя)</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдДокОснДовОргСост</name>
    <comment>Идентификатор документа-основания, по которому экономический субъект является составителем файла обмена первичного учетного документа о факте хозяйственной жизни (информации грузоотправителя)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатПодп</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыПодписанта</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдФайлПУДИнфПрв</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатФайлПУДИнфПрв</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрФайлПУДИнфПрв</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭП</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОКПО</name>
    <comment>ОКПО</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурноеПодразделение</name>
    <comment>Структурное подразделение</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокИспользованияФайлаОбмена</name>
    <comment>Дополнительная информация, позволяющая в автоматизированном режиме определять необходимый для конкретного случая порядок использования информации файла обмена у грузоотправителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеНазвание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчета</name>
    <comment>Номер банковского счета</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеБанка</name>
    <comment>Наименование банка</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БИК</name>
    <comment>Банковский идентификационный код (БИК)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КорСчет</name>
    <comment>Корреспондентский счет банка</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПлательщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаимДокОснИнПлат</name>
    <comment>Наименование документа-основание, по которому ¶денежные средства будут поступать в оплату перевозки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокОснИнПлат</name>
    <comment>Номер документаоснование, по которому денежные средства будут поступать в оплату перевозки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокОснИнПлат</name>
    <comment>Дата документа-основание, по которому денежные средства будут поступать в оплату перевозки</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопСведДокОснИнПлат</name>
    <comment>Доп. сведения документа-основание, по которому ¶денежные средства будут поступать в оплату перевозки</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтороныСостДокОснИнПлат</name>
    <comment>Стороны составители документа-основание, по которому ¶денежные средства будут поступать в оплату перевозки</comment>
    <type>
      <types>EnumRef.КонтурЛогистика_СтороныСоставители</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопСостДокОснИнПлат</name>
    <comment>Доп. составитель документа-основание, по которому ¶денежные средства будут поступать в оплату перевозки</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдДокОснИнПлат</name>
    <comment>Идентификатор документа-основание, по которому денежные средства будут поступать в оплату перевозки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказаВПодписи</name>
    <comment>Причина отказа в подписи</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОтказВПодписи</name>
    <comment>Флаг отказа в подписи</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИнфПол</name>
    <comment>Информационные поля</comment>
    <attributes>
      <name>Идентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтметкиИнфПол</name>
    <attributes>
      <name>ИдФайлИнфПол</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстИнфИдентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстИнфЗначение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_КатегорииОшибокОбъектов/КонтурЛогистика_КатегорииОшибокОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_КатегорииОшибокОбъектов</name>
  <enumValues>
    <name>Предупреждение</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаДиадок</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаДругойСтороны</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаКриптографии</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ТрН_Титул6/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	КонтурЛогистика_ОбработкаДокументовСервер.ОбработкаПолученияПредставленияДокументаТитулаТрН(Данные, Представление, СтандартнаяОбработка, "6");
	
КонецПроцедуры

// Обязательные манифесты:

Функция МассивОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	МассивОбязательных.Добавить("ПользовательПодписант");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивДополнительныхРеквизитов() Экспорт
	
	МассивДополнительных = Новый Массив();
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция МассивДополнительныхРеквизитовТЧ() Экспорт
	
	МассивДополнительных = Новый Массив();
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция КлючевыеРеквизитыСАвтоматическимЗаполнением() Экспорт
	
	МассивКлючевых = Новый Массив();
	
	МассивКлючевых.Добавить("ДокументЭТРН");
	МассивКлючевых.Добавить("ДокументОснование");
	МассивКлючевых.Добавить("СпосПодтПолном");
	МассивКлючевых.Добавить("ТипПодпис");
	МассивКлючевых.Добавить("СтатПодп");
	МассивКлючевых.Добавить("Должность");
	МассивКлючевых.Добавить("Фамилия");
	МассивКлючевых.Добавить("Имя");
	МассивКлючевых.Добавить("Отчество");
	
	МассивКлючевых.Добавить("ДатПУДИнфГО");
	МассивКлючевых.Добавить("ВрПУДИнфГО");
	
	МассивКлючевых.Добавить("ИдФайлПУДИнфПрв");
	МассивКлючевых.Добавить("ДатФайлПУДИнфПрв");
	МассивКлючевых.Добавить("ВрФайлПУДИнфПрв");
	МассивКлючевых.Добавить("ЭП");
	
	МассивКлючевых.Добавить("НомИспр");
	МассивКлючевых.Добавить("ДатаИспр");
	
	Возврат МассивКлючевых;
	
КонецФункции

Функция ПроверитьДокумент(Знач Объект, ТаблицаОшибок = Неопределено, ПараметрыФормированияФайлов = Неопределено) Экспорт
	
	Если ТаблицаОшибок = Неопределено Тогда
		ТаблицаОшибок = КонтурЛогистика_ПанельОшибокСервер.ИнициализироватьТаблицуОшибок();
	КонецЕсли;
	
	ТекСтатусТитула = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(Объект.Ссылка, Истина);
	
	ТаблицаОшибок.Очистить();
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда
		КонтурЛогистика_ПанельОшибокСервер.ВывестиОшибкуТекущегоТитула(Объект.Ссылка, ТаблицаОшибок)
	КонецЕсли;
	
	КонтурЛогистика_ПанельОшибокСервер.ПроверитьОшибкиПредыдущегоТитула(Объект.Ссылка, Объект.ДокументЭТРН, ТаблицаОшибок);
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен 
		Или ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки 
		Или ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученОбработанСПредупреждением Тогда
		
		// TODO понять какие сценарии проверки входящего документа
		
	Иначе
		
		// TODO реализовать проверку документа
		
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьПредупреждения(Объект.Ссылка, ТаблицаОшибок);
		
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьДиадокОшибки(Объект.Ссылка, ТаблицаОшибок);
		
		КонтурЛогистика_ОбщегоНазначенияСервер.ВалидацияВыполненияАвторизации(Объект,
			Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул6, ТаблицаОшибок);
		
		ПроверитьШапку(Объект, ТаблицаОшибок);
				
		КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьПодписанта(
			Объект, ТаблицаОшибок,, ПараметрыФормированияФайлов);
		
	КонецЕсли;
	
	КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьРоуминг(Объект.Ссылка, ТаблицаОшибок);
	
	Результат = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьШапку(Знач Объект, ТаблицаОшибок)
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	
	ДокументЭТРН = Объект.ДокументЭТРН;
	
	Если НЕ ЗначениеЗаполнено(ДокументЭТРН)  Тогда
		
		ТекстОшибки = "Титул не привязан к Документу электронной транспортной накладной";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
		"ДокументЭТРН", КатегорияОшибка, ТекстОшибки, "Указать");
		
	Иначе
		
		ОбязательныеРеквизитыТРН = Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.МассивОбязательныхРеквизитов();
		
		Для Каждого ОбязательныйРевизит Из ОбязательныеРеквизитыТРН Цикл
			Если НЕ ЗначениеЗаполнено(ДокументЭТРН[ОбязательныйРевизит])  Тогда
				
				ОбязательныйРевизитСиноним = Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.СинонимРеквизита(ОбязательныйРевизит);
				ТекстОшибки = "Укажите " + ОбязательныйРевизитСиноним + " в Документе электронной транспортной накладной";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ГлавныйДокумент." + ОбязательныйРевизит, КатегорияОшибка, ТекстОшибки, "Указать");
				
			КонецЕсли;
		КонецЦикла;
		
		// можно не проверять этрн - она была сформирована на этапе Т1
		// Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ПроверитьКлючевыеРеквизитыЭтРН(ДокументЭТРН, ТаблицаОшибок);

	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ЭП)  Тогда
		
		ТекстОшибки = "Не получена подпись перевозчика. Попробуйте выполнить обмен и перезаполнить титул";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
		"ЭП", КатегорияОшибка, ТекстОшибки, "Выполнить обмен");
	КонецЕсли;
	
	Для Каждого ОбязательныйРевизит Из МассивОбязательныхРеквизитов() Цикл
		
		Если Прав(ОбязательныйРевизит, 6) = "Массив" ИЛИ Прав(ОбязательныйРевизит, 14) = "МассивСтруктур" Тогда 
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект[ОбязательныйРевизит]) Тогда
			
			ОбязательныйРевизитСиноним = Документы.КонтурЛогистика_ТрН_Титул6.СинонимРеквизита(ОбязательныйРевизит);
			ТекстОшибки = "Укажите " + ОбязательныйРевизитСиноним;
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			ОбязательныйРевизит, КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
	КонецЦикла;
		
	Если Не Объект.ЕстьОтказВПодписи Тогда 
		
		Если ЗначениеЗаполнено(Объект.НомерСчета) Тогда
			
			Если СтрДлина(Объект.НомерСчета) < 20 Тогда
				
				ТекстОшибки = "Укажите корректную длину (" + СтрДлина(Объект.НомерСчета) + " из 20) счета банка.";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"НомерСчета", КатегорияОшибка, ТекстОшибки, "Указать");
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.КорСчет) И СтрДлина(Объект.КорСчет) < 20 Тогда 
			
			ТекстОшибки = "Укажите корректную длину (" + СтрДлина(Объект.КорСчет) + " из 20) корреспондентского счета банка.";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"КорСчет", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.БИК) И СтрДлина(Объект.БИК) < 9 Тогда 
			
			ТекстОшибки = "Укажите корректную длину (" + СтрДлина(Объект.БИК) + " из 9) БИКа банка.";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"БИК", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
		// Провдение документа основания
		КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьПроведениеДокументаОснования(Объект, ТаблицаОшибок, КатегорияОшибка);
		
		Если ЗначениеЗаполнено(Объект.НаименованиеПлательщика) Тогда 
			
			Если Не ЗначениеЗаполнено(Объект.ИдДокОснИнПлат) 
				И Не ЗначениеЗаполнено(Объект.НаимДокОснИнПлат) 
				И Не ЗначениеЗаполнено(Объект.ДатаДокОснИнПлат) 
				И Не ЗначениеЗаполнено(Объект.СтороныСостДокОснИнПлат) 
				И Не ЗначениеЗаполнено(Объект.ДопСостДокОснИнПлат) Тогда 
			
				ТекстОшибки = "Укажите Идентификатор ИЛИ Наименование, Номер, Дату и Составителей документа основания для оплаты.";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
							"ИдДокПлат", КатегорияОшибка, ТекстОшибки, "Указать");
				
			КонецЕсли;	
				
			Если Не ЗначениеЗаполнено(Объект.ИдДокОснИнПлат) 
				И (ЗначениеЗаполнено(Объект.НаимДокОснИнПлат)
				Или ЗначениеЗаполнено(Объект.НомерДокОснИнПлат) 
				Или ЗначениеЗаполнено(Объект.ДатаДокОснИнПлат)
				Или ЗначениеЗаполнено(Объект.ДопСведДокОснИнПлат)
				Или ЗначениеЗаполнено(Объект.СтороныСостДокОснИнПлат) 
				Или ЗначениеЗаполнено(Объект.ДопСостДокОснИнПлат)) Тогда	
					
				Если Не ЗначениеЗаполнено(Объект.НаимДокОснИнПлат) Тогда 
					
					ТекстОшибки = "Укажите наименование Документа основания для оплаты.";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
								"НаимДокПлат", КатегорияОшибка, ТекстОшибки, "Указать");
					
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(Объект.ДатаДокОснИнПлат) Тогда 
					
					ТекстОшибки = "Укажите дату Документа основания для оплаты.";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
								"ДатаДокПлат", КатегорияОшибка, ТекстОшибки, "Указать");
					
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(Объект.СтороныСостДокОснИнПлат) И Не ЗначениеЗаполнено(Объект.ДопСостДокОснИнПлат) Тогда 
					
					ТекстОшибки = "Укажите стороны составители или доп.составителя Документа основания переадресовки для оплаты.";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
								"СтороныСост", КатегорияОшибка, ТекстОшибки, "Указать");
					
				КонецЕсли;
					
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		Если Не ЗначениеЗаполнено(Объект.ПричинаОтказаВПодписи) Тогда 
			
			ТекстОшибки = "Укажите причину отказа в подписи.";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(
				ТаблицаОшибок, "", "", "ПричинаОтказаВПодписи", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
	КонецЕсли;
	
	// TODO
	// ГЛУБОКИЕ ВАЛИДАЦИИ, ВЗАИМНЫЕ ВАЛИДАЦИИ
	
КонецПроцедуры

Функция СинонимРеквизита(ИмяРеквизита) Экспорт

	Попытка
	
		Возврат Метаданные.Документы.КонтурЛогистика_ТрН_Титул6.Реквизиты[ИмяРеквизита].Синоним;
	
	Исключение
		
		//TODO метрику
		Возврат ИмяРеквизита;
		
	КонецПопытки;

КонецФункции

#КонецЕсли
